---
kind: type
id: T:Autodesk.Revit.Exceptions.ServerInternalException
source: html/dea21550-dd2d-e9d1-4f2f-5f18e0e58bc4.htm
---
# Autodesk.Revit.Exceptions.ServerInternalException

## Syntax (C#)
```csharp
[SerializableAttribute]
public class ServerInternalException : ApplicationException
```